app/controllers/api/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
    @places = Place.all

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @place = Place.find_by(id: params[:id])

INSERT INTO "places" ("title", "location", "type_of_place", "max_guests", "num_of_bedrooms", "num_of_bathrooms", "num_of_beds", "about", "nearby_attractions", "rules", "price_per_day", "cancellation_policy", "check_in_from", "check_out_before", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    @place = Place.new(place_params)

    if @place && @place.save

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "places" SET "title" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["title", "Best Cabin in the Woods"], ["updated_at", "2021-04-14 23:17:42.864473"], ["id", 5]]
---
  def update
    @place = Place.find_by(id: params[:id])

    if @place && current_user.id == @place.owner_id && @place.update(place_params)

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 5]]
---
  def destroy
    @place = Place.find_by(id: params[:id])

    if @place && current_user.id == @place.id
      @place.delete