PridefulBnB/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.session_token.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "v1nMKUJifcYwBm-SUqm7MA"], ["updated_at", "2021-04-06 01:52:11.332509"], ["id", 2]]