app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "P7Vf1zP2zipCfvHZ5MuZLw"], ["updated_at", "2021-04-14 20:46:09.251534"], ["id", 15]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save